[
    { "text": "Security protocol implementations often involve components written in different languages. Traditional verification struggles with this heterogeneity. We introduce a new symbolic framework that enables sound, parallel composition across multiple languages and attacker models without relying on transations between incompatible base types like bitstrings and abstract terms.\n Read more about our work here https://arxiv.org/abs/2504.06833, and check out our toolchain https://github.com/FMSecure/CryptoBAP", "image": "https://raw.githubusercontent.com/hnemati/hnemati.github.io/02c4a4d7a06d9bbfd42336345c4741758ac81421/img/cryptobap-parallel.png", "timestamp": "2025-05-17T13:30:00Z" },	
    { "text": "We have two Ph.D. positions open at KTH, focusing on Automated AI-based Code/Proof Generation. Read more about the position and apply here:https://www.kth.se/lediga-jobb/816323?l=en", "image": "", "timestamp": "2025-05-10T07:15:00Z" },	
    { "text": "We are looking for a Research Engineer to join us at KTH in Stockholm! The position is initially for 6 months, with the possibility of a 6-month extension.\n If you are interested, you can find more details and apply here: https://www.kth.se/lediga-jobb/822237?l=en.\n Feel free to reach out if you have any questions!", "image": "", "timestamp": "2025-05-01T11:06:00Z" },
    { "text": "We are looking for a Postdoc Researcher to help us build a framework to protect programs from hardware attacks!\n The position is offering the chance to conduct research, supervise PhD students and research engineers, and collaborate with experts in security.\n Having experience in formal verification, microarchitectural security, program analysis, or compiler design is a plus.\n Join us at KTH Royal Institute of Technology in Stockholm!\n Apply here: https://www.kth.se/lediga-jobb/796677?l=en", "image": "https://cdn.varbi.com/177/ed1ff0c4d39f0d6d223ce07fef09c312.jpg", "timestamp": "2025-02-09T16:06:00Z" },
    {"text": "If you are into microarchitectural attacks, check out our recent arXiv paper. To summarize, we show that the devil is in the 'micro' details!\n We analyzed the microcode of Intel processors and showed the root cause of many Spectre attacks. We found out that some of the known variants are indeed misclassified.\n\n More details and experiments on other x86 processors are hopefully coming soon in the paper's conference version: https://arxiv.org/abs/2501.12890", "image": "https://raw.githubusercontent.com/hnemati/hnemati.github.io/refs/heads/master/img/uspectre-img.jpeg", "timestamp": "2025-01-26T10:00:00Z"}
]
